#### Terraform Format and Style 🖌`failure`
🚨 **Terraform Format failed!**
Please run `terraform fmt -recursive` and push the changes.

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.iam.aws_iam_user.manager: Refreshing state... [id=manager]
module.iam.aws_iam_user.dev: Refreshing state... [id=dev]
module.iam.data.aws_caller_identity.current: Reading...
module.iam.aws_iam_role.nodes: Refreshing state... [id=eks-node-group-nodes]
module.iam.aws_iam_policy.dev_eks: Refreshing state... [id=arn:aws:iam::345215350058:policy/AmazonEKSDeveloperPolicy]
module.iam.aws_iam_policy.aws_lbc: Refreshing state... [id=arn:aws:iam::345215350058:policy/AWSLoadBalancerController]
module.iam.aws_iam_policy.eks_admin: Refreshing state... [id=arn:aws:iam::345215350058:policy/AmazonEKSAdminPolicy]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-008829af9151004c2]
module.kms.aws_kms_key.aurora: Refreshing state... [id=8b8657f8-91a7-4a5a-876a-b8afffd18355]
module.iam.aws_iam_role.sftp_user_role: Refreshing state... [id=sftp_user_role]
module.iam.data.aws_caller_identity.current: Read complete after 1s [id=345215350058]
module.iam.aws_iam_role.process_monetary_transactions_lambda_role: Refreshing state... [id=process_monetary_transactions_lambda_role]
module.transfer_family.aws_transfer_server.sftp_server: Refreshing state... [id=s-ccf88d42a160440db]
module.efs.aws_efs_file_system.eks: Refreshing state... [id=fs-042819366c57adf95]
module.dynamodb.aws_dynamodb_table.main: Refreshing state... [id=business_transactions_table]
module.iam.data.aws_iam_policy_document.pod_assume_policy: Reading...
module.iam.data.aws_iam_policy_document.pod_assume_policy: Read complete after 0s [id=819195744]
module.s3.aws_s3_bucket.sftp_bucket: Refreshing state... [id=scrooge-bank-g3t3-sftp-bucket]
module.iam.aws_iam_role.eks: Refreshing state... [id=eks-cluster-prod]
module.iam.aws_iam_role.eks_admin: Refreshing state... [id=eks-admin-role]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.glue.aws_glue_registry.scrooge-bank-registry will be created
  + resource "aws_glue_registry" "scrooge-bank-registry" {
      + arn           = (known after apply)
      + id            = (known after apply)
      + registry_name = "scrooge-bank-registry"
      + tags_all      = (known after apply)
    }

  # module.glue.aws_glue_schema.a2c will be created
  + resource "aws_glue_schema" "a2c" {
      + arn                   = (known after apply)
      + compatibility         = "BACKWARD"
      + data_format           = "PROTOBUF"
      + id                    = (known after apply)
      + latest_schema_version = (known after apply)
      + next_schema_version   = (known after apply)
      + registry_arn          = (known after apply)
      + registry_name         = (known after apply)
      + schema_checkpoint     = (known after apply)
      + schema_definition     = <<-EOT
            syntax = "proto3";
            package com.cs301.shared;
            
            option java_multiple_files = true;
            option java_package = "com.cs301.shared.protobuf";
            message A2C {
              string agent_id = 1;
              string client_id = 2;
              string client_email = 3;
              string crud_type = 4;
              string account_id = 5;
              string account_type = 6;
            }
        EOT
      + schema_name           = "a2c"
      + tags_all              = (known after apply)
    }

  # module.glue.aws_glue_schema.c2c will be created
  + resource "aws_glue_schema" "c2c" {
      + arn                   = (known after apply)
      + compatibility         = "BACKWARD"
      + data_format           = "PROTOBUF"
      + id                    = (known after apply)
      + latest_schema_version = (known after apply)
      + next_schema_version   = (known after apply)
      + registry_arn          = (known after apply)
      + registry_name         = (known after apply)
      + schema_checkpoint     = (known after apply)
      + schema_definition     = <<-EOT
            syntax = "proto3";
            package com.cs301.shared;
            
            option java_multiple_files = true;
            option java_package = "com.cs301.shared.protobuf";
            
            message C2C {
              string agent_id = 1;
              string client_id = 2;
              string client_email = 3;
              string crud_type = 4;
              CRUDInfo crud_info = 5;
            }
            
            message CRUDInfo {
              string attribute = 1;
              string before_value = 2;
              string after_value = 3;
            }
        EOT
      + schema_name           = "c2c"
      + tags_all              = (known after apply)
    }

  # module.glue.aws_glue_schema.log will be created
  + resource "aws_glue_schema" "log" {
      + arn                   = (known after apply)
      + compatibility         = "BACKWARD"
      + data_format           = "PROTOBUF"
      + id                    = (known after apply)
      + latest_schema_version = (known after apply)
      + next_schema_version   = (known after apply)
      + registry_arn          = (known after apply)
      + registry_name         = (known after apply)
      + schema_checkpoint     = (known after apply)
      + schema_definition     = <<-EOT
            syntax = "proto3";
            
            package com.cs301.shared;
            
            option java_multiple_files = true;
            option java_package = "com.cs301.shared.protobuf";
            
            message Log {
              string log_id = 1;
              string actor = 2;
              string transaction_type = 3;
              string action = 4;
              string timestamp = 5;
            }
        EOT
      + schema_name           = "log"
      + tags_all              = (known after apply)
    }

  # module.glue.aws_glue_schema.otp will be created
  + resource "aws_glue_schema" "otp" {
      + arn                   = (known after apply)
      + compatibility         = "BACKWARD"
      + data_format           = "PROTOBUF"
      + id                    = (known after apply)
      + latest_schema_version = (known after apply)
      + next_schema_version   = (known after apply)
      + registry_arn          = (known after apply)
      + registry_name         = (known after apply)
      + schema_checkpoint     = (known after apply)
      + schema_definition     = <<-EOT
            syntax = "proto3";
            
            package com.cs301.shared;
            
            option java_multiple_files = true;
            option java_package = "com.cs301.shared.protobuf";
            
            message Otp {
              string user_email = 1;
              uint32 otp = 2;
              string timestamp = 3;
            }
        EOT
      + schema_name           = "otp"
      + tags_all              = (known after apply)
    }

  # module.glue.aws_glue_schema.u2c will be created
  + resource "aws_glue_schema" "u2c" {
      + arn                   = (known after apply)
      + compatibility         = "BACKWARD"
      + data_format           = "PROTOBUF"
      + id                    = (known after apply)
      + latest_schema_version = (known after apply)
      + next_schema_version   = (known after apply)
      + registry_arn          = (known after apply)
      + registry_name         = (known after apply)
      + schema_checkpoint     = (known after apply)
      + schema_definition     = <<-EOT
            syntax = "proto3";
            package com.cs301.shared;
            
            option java_multiple_files = true;
            option java_package = "com.cs301.shared.protobuf";
            message U2C {
              string user_email = 1;
              string username = 2;
              string temp_password = 3;
              string user_role = 4;
            }
        EOT
      + schema_name           = "u2c"
      + tags_all              = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @gavwyh, Action: `pull_request`*